Repository: agnsm/CipherApp
Catalog: CipherApp/Resources/Views/Home/Index.*.resx
Languages: pl

source: decoder
pl: dekoder

# DecoderCipher
source: enter the encrypted text:
pl: wprowadź zaszyfrowany tekst

# DecoderPlain
source: your decrypted text:
pl: twój odszyfrowany tekst

source: decrypt
pl: odszyfruj

# Description
source: A tool for encrypting and decrypting messages with the Vigenère cipher using English alphabet.
pl: Narzędzie umożliwiające szyfrowanie i odszyfrowywanie wiadomości za pomocą szyfru Vigenère'a.

source: encoder
pl: enkoder

# EncoderCipher
source: your encrypted text:
pl: twój zaszyfrowany tekst

# EncoderPlain
source: enter plain text:
pl: wprowadź zwykły tekst

source: encrypt
pl: zaszyfruj

# Heading
source: Vigenère cipher
pl: Szyfr Vigenère'a

source: History:
pl: Historia i zastosowanie:

# HistoryDesc
source: The weakness of monoalphabetic ciphers meant that attempts were made to come up with more elaborate ciphers. The natural step was to use several alphabets instead of one as in the case of monoalphabetic ciphers. This gave rise to polyalphabetic base ciphers. The idea of such a cipher appeared already in the 15th century (Leon Battista Alberti). Further ideas are connected with such names as Johannes Trithemius and Giovanni della Porta. The most famous polyalphabetic cipher was created by Blaise de Vigenere, officially published in his work "Traicte des Chiffres" in 1586. While creating his cipher, Vigenere relied on the thoughts of the previously mentioned people.
pl: Słabość szyfrów monoalfabetycznych sprawiła, że próbowano wymyślać bardziej rozbudowane szyfry. Naturalnym krokiem było korzystanie z kilku alfabetów zamiast jednego jak w przypadku szyfrów monoalfabetycznych. Dało to początek polialfabetycznym szyfrom podstawieniowym. Idea takiego szyfru pojawiła się już w XV wieku (Leon Battista Alberti). Kolejne pomysły związane są z takimi nazwiskami jak Johannes Trithemius oraz Giovanni della Porta. Najbardziej znany szyfr polialfabetyczny został stworzony przez Blaise de Vigenere`a, oficjalnie opublikowany w jego pracy "Traicte des Chiffres" w 1586 roku. Podczas tworzenia swojego szyfru Vigenere opierał się na przemyśleniach wcześniej wymienionych osób.

# InfoHeading
source: about vigenère cipher
pl: o szyfrze vigenère'a

# Key
source: enter key:
pl: podaj słowo kluczowe

# LinkInfo
source: More information about the Vigenère cipher
pl: Więcej informacji o szyfrze Vigenère'a

# MainButton
source: $t4rt 3ncrypt1ng
pl: z4$zyfrvj c0ś

# Method
source: Method description:
pl: Opis metody:

# MethodDesc
source: We encrypt the text based on the password. The encryption is performed as follows. Each letter of the plaintext is encrypted using the alphabet starting with the corresponding letter in the password. In case the password is shorter than the ciphertext we repeat it many times. Encryption and decryption is done on the basis of Vigenere's table.
pl: Tekst szyfrujemy na podstawie hasła. Szyfrowanie odbywa się w sposób następujący. Każdą literę tekstu jawnego szyfrujemy korzystając z alfabetu zaczynającego się od odpowiadającej litery w haśle. W przypadku, gdy hasło jest krótsze od szyfrowanego tekstu powtarzamy je wielokrotnie. Szyfrowanie i deszyfrowanie odbywa się na podstawie tablicy Vigenere`a.

# Subheading
source: coder and encoder
pl: koder i dekoder

source: Type:
pl: Rodzaj:

# TypeDesc
source: Polyalphabetic substitution cipher
pl: Polialfabetyczny szyfr podstawieniowy
